environments/wrk_http_benchmarking_medium/data/endpoint_a.log
Running 30s test @ http://api.example.com/endpoint_a
  2 threads and 10 connections
  Thread calibration: mean lat.: 15.234ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 14.892ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.56ms    8.92ms  187.39ms   89.34%
    Req/Sec   872.45    134.67   1185.00   87.23%
  Latency Distribution (HdrHistogram - Recorded Latency)
   50.000%   12.45ms
   75.000%   18.23ms
   90.000%   25.67ms
   99.000%   45.89ms
   99.900%   98.34ms
   99.990%  156.78ms
   99.999%  182.50ms
  100.000%  187.39ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      6.123     0.000000            1         1.00
      8.456     0.100000         2547         1.11
     10.234     0.200000         5094         1.25
     11.567     0.300000         7641         1.43
     12.012     0.400000        10188         1.67
     12.451     0.500000        12735         2.00
     13.234     0.550000        14009         2.22
     14.678     0.600000        15282         2.50
     16.234     0.650000        16556         2.86
     17.456     0.700000        17829         3.33
     18.234     0.750000        19103         4.00
     19.123     0.775000        19740         4.44
     20.456     0.800000        20377         5.00
     22.234     0.825000        21014         5.71
     23.567     0.850000        21651         6.67
     25.678     0.900000        22925        10.00
     28.234     0.925000        23243        13.33
     31.456     0.950000        24196        20.00
     35.678     0.962500        24515        26.67
     39.234     0.975000        24833        40.00
     42.567     0.981250        24992        53.33
     45.891     0.990000        25242       100.00
     52.345     0.993750        25401       160.00
     61.234     0.996875        25515       320.00
     73.456     0.998437        25606       640.00
     84.678     0.999219        25652      1280.00
     98.345     0.999609        25675      2560.00
    123.456     0.999805        25686      5120.00
    145.234     0.999902        25692     10240.00
    156.789     0.999951        25695     20480.00
    168.234     0.999976        25697     40960.00
    175.456     0.999988        25698     81920.00
    182.500     0.999994        25699    163840.00
    187.391     1.000000        25700          inf
#[Mean    =       14.561, StdDeviation   =        8.918]
#[Max     =      187.391, Total count    =        25700]
#[Buckets =           27, SubBuckets     =         2048]
  25700 requests in 30.01s, 1.54MB read
Requests/sec:    856.38
Transfer/sec:     52.54KB