environments/wrk_http_benchmarking_medium/data/endpoint_c.log
Running 30s test @ http://api.example.com/endpoint_c
  2 threads and 10 connections
  Thread calibration: mean lat.: 28.456ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 27.893ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    28.45ms   15.67ms  450.23ms   87.34%
    Req/Sec   345.67    78.92    512.00    71.25%
  Latency Distribution (HdrHistogram - Recorded Latency)
   50.000%   25.67ms
   75.000%   32.45ms
   90.000%   45.78ms
   99.000%   98.34ms
   99.900%  234.56ms
   99.990%  387.90ms
   99.999%  445.12ms
  100.000%  450.23ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      12.345     0.000000            1         1.00
      18.234     0.100000         2012         1.11
      21.567     0.200000         3998         1.25
      23.890     0.300000         5987         1.43
      24.678     0.400000         7976         1.67
      25.670     0.500000         9965         2.00
      26.890     0.550000        10959         2.22
      28.456     0.600000        11954         2.50
      30.123     0.650000        12949         2.86
      31.234     0.700000        13943         3.33
      32.450     0.750000        14938         4.00
      34.567     0.775000        15435         4.44
      36.789     0.800000        15933         5.00
      39.012     0.825000        16430         5.71
      41.234     0.850000        16927         6.67
      45.780     0.900000        17922        10.00
      52.345     0.925000        18420        13.33
      61.234     0.950000        18918        20.00
      73.456     0.962500        19167        26.67
      82.345     0.975000        19415        40.00
      89.234     0.981250        19540        53.33
      98.340     0.990000        19713       100.00
     125.678     0.993750        19838       160.00
     156.789     0.996875        19900       320.00
     189.234     0.998438        19962       640.00
     234.560     0.999023        19993      1024.00
     267.890     0.999512        20009      2048.00
     298.456     0.999756        20024      4096.00
     334.567     0.999878        20032      8192.00
     365.234     0.999939        20040     16384.00
     387.900     0.999969        20044     32768.00
     412.345     0.999985        20048     65536.00
     429.678     0.999992        20050    131072.00
     445.120     0.999996        20052    262144.00
     448.567     0.999998        20053    524288.00
     450.230     1.000000        20054          inf
#[Mean    =       28.447, StdDeviation   =       15.671]
#[Max     =      450.230, Total count    =        20054]
#[Buckets =           27, SubBuckets     =         2048]
  20054 requests in 30.02s, 3.45MB read
  Socket errors: connect 0, read 0, write 0, timeout 0
  Requests/sec:    668.23
Transfer/sec:    117.83KB